@echo off&setlocal enabledelayedexpansion
mode con cols=71 lines=9
for /l %%a in (1,1,8) do (
echo/
echo\
echo.
echo **********************************************************************
echo *************************ÀºÇò·ÉÈË»ð±¬°æ*******************************
echo **********************************************************************
color cf
ping -n 1 127.1>nul
color fc
ping -n 1 127.1>nul
cls
)
color f1
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo               o                                                     ^|
echo              /^|\o                                                   ^|
echo _____________/_\____________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo                  o                                                  ^|
echo                 /^|\                                                 ^|
echo ________________/_^>_o_______________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo                       o                                             ^|
echo                      /^|\o                                           ^|
echo ______________________^>_\___________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo                        o                                            ^|
echo                       /^|\                                           ^|
echo ______________________/_^>_o_________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo                           o                                         ^|
echo                          /^|-o                                       ^|
echo __________________________^>\________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo                              o                                      ^|
echo                             /^|\                                     ^|
echo ____________________________/_^>_o___________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                        ·£ÇòÏßµ½ÁË!                              £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo                                 o                                   ^|
echo                                /^|-o                                 ^|
echo ________________________________^>^>__________________________________^|
ping -n 2 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                        o                       £Ö'  ^|
echo                                      o/                             ^|
echo                                     /^|                              ^|
echo                                      ^>\                             ^|
echo ____________________________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                            o                   £½^|--^|
echo                                           o^|                   £Ö'  ^|
echo                                          /^|                         ^|
echo                                          / ^>                        ^|
echo                                                                     ^|
echo ____________________________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                 o                   ^|
echo                                                o^|              £½^|--^|
echo                                               /^|               £Ö'  ^|
echo                                                ^>\                   ^|
echo                                                                     ^|
echo                                                                     ^|
echo ____________________________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                       o             ^|
echo                                                     o/              ^|
echo                                                    /^|          £½^|--^|
echo                                                    / ^>         £Ö'  ^|
echo                                                                     ^|
echo                                                                     ^|
echo                                                                     ^|
echo ____________________________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                            o        ^|
echo                                                          o/         ^|
echo                                                         /^|     £½^|--^|
echo                                                         / \    £Ö'  ^|
echo                                                                     ^|
echo                                                                     ^|
echo                                                                     ^|
echo ____________________________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                o    ^|
echo                                                              o/£½^|--^|
echo                                                             /^| £Ö'  ^|
echo                                                             //      ^|
echo                                                                     ^|
echo                                                                     ^|
echo ____________________________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                ¦Õ'  ^|
echo                                                                 o   ^|
echo                                                                -^|\  ^|
echo                                                                 ^>^>  ^|
echo ____________________________________________________________________^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                               o     ^|
echo                                                                   o ^|
echo                                                                  /^|\^|
echo __________________________________________________________________^>^>^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                                                     ^|
echo                                                              o   o  ^|
echo                                                                 /^|- ^|
echo ________________________________________________________________/_\_^|
ping -n 1 127.1>nul
cls
echo                                                                     ^|
echo                                                                     ^|
echo                                                                £½^|--^|
echo                                                                £Ö'  ^|
echo                                             Ë§Æø°É? ºÇºÇ~~~         ^|
echo                                                                 o   ^|
echo                                                            o   /^|\  ^|
echo _______________________________________________________________/_\__^|
cls
for /l %%a in (1,1,8) do (
echo/
echo\
echo.
echo **********************************************************************
echo ***************************GAME OVER**********************************
echo **********************************************************************
color cf
ping -n 1 127.1>nul
color fc
ping -n 1 127.1>nul
cls
)
pause>nul 


