----------------------------CUTS HERE--------------------------- 
@echo off 
tiyle 颜色调节器 by◥你dё圣 ▉ 
cls 
:shuxing 
echo ------------------------------------------ 
echo COLOR [attr] 
echo ------------------------------------------ 
echo   attr        指定控制台输出的颜色属性 
echo ------------------------------------------ 
echo 颜色属性由两个十六进制数字指定 -- 第一个为背景，第二个则为 
echo 前景。每个数字可以为以下任何值之一: 
echo ------------------------------------------ 
echo    0 = 黑色       8 = 灰色 
echo    1 = 蓝色       9 = 淡蓝色 
echo    2 = 绿色       A = 淡绿色 
echo    3 = 湖蓝色     B = 淡浅绿色 
echo    4 = 红色       C = 淡红色 
echo    5 = 紫色       D = 淡紫色 
echo    6 = 黄色       E = 淡黄色 
echo    7 = 白色       F = 亮白色 
echo ------------------------------------------ 
echo 如果没有给定任何参数，该命令会将颜色还原到 CMD.EXE 启动时 
echo 的颜色。这个值来自当前控制台窗口、/T 开关或 
echo DefaultColor 注册表值。 
echo ------------------------------------------ 
echo 如果用相同的前景和背景颜色来执行 COLOR 命令，COLOR 命令 
echo 会将 ERRORLEVEL 设置为 1。 
echo ------------------------------------------ 
echo 例如: "COLOR fc" 在亮白色上产生亮红色 
set x= 
set /p x=请输入颜色: 
color %x% 
pause>nul 
cls 
echo ------------------------------------------ 
echo 输入Y(yes) 继续 
echo 输入E(exit)退出 
echo            BY◥你dё圣 ▉ QQ75601346 
echo ------------------------------------------ 
set choose = 
set /p choose=请选择： 
if '%choose%'=='y' goto shuxing 
if '%choose%'=='e' (goto :exit) else goto tishi 
:tishi 
echo ------------------------------------------ 
echo 你没按提示输入！任意键重试！ 
echo BY◥你dё圣 ▉ QQ75601346 
echo ------------------------------------------ 
pause>nul 
goto :shuxing 
:exit 
echo ------------------------------------------ 
echo 颜色调节器  任意键退出 
echo    by◥你dё圣 ▉ QQ75601346 
echo ------------------------------------------ 
pause>nul 
exit 
--------------------------cuts here----------------------------- 
